Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_reg.h
/** \brief  204, Watch Dog Timer Register */
#define PSI5_CH3_WDT5 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005204u)

/** Alias (User Manual Name) for PSI5_CH3_WDT5.
* To use register names with standard convension, please use PSI5_CH3_WDT5.
*/
#define	PSI5_WDT35	(PSI5_CH3_WDT5)

/** \brief  208, Watch Dog Timer Register */
#define PSI5_CH3_WDT6 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005208u)

/** Alias (User Manual Name) for PSI5_CH3_WDT6.
* To use register names with standard convension, please use PSI5_CH3_WDT6.
*/
#define	PSI5_WDT36	(PSI5_CH3_WDT6)

/** \brief  0, Clock Control Register */
#define PSI5_CLC /*lint --e(923)*/ (*(volatile Ifx_PSI5_CLC*)0xF0005000u)

/** \brief  59C, CRCI Overview Clear Register 0 */
#define PSI5_CRCICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF000559Cu)

/** \brief  5A0, CRCI Overview Clear Register 0 */
#define PSI5_CRCICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A0u)

/** \brief  5A4, CRCI Overview Clear Register 0 */
#define PSI5_CRCICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A4u)

/** \brief  5A8, CRCI Overview Clear Register 0 */
#define PSI5_CRCICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCICLR*)0xF00055A8u)

/** \brief  45C, CRCI Overview Register */
#define PSI5_CRCIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF000545Cu)

/** \brief  460, CRCI Overview Register */
#define PSI5_CRCIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005460u)

/** \brief  464, CRCI Overview Register */
#define PSI5_CRCIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005464u)

/** \brief  468, CRCI Overview Register */
#define PSI5_CRCIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005468u)

/** \brief  4FC, CRCI Overview Set Register 0 */
#define PSI5_CRCISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF00054FCu)

/** \brief  500, CRCI Overview Set Register 0 */
#define PSI5_CRCISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005500u)

/** \brief  504, CRCI Overview Set Register 0 */
#define PSI5_CRCISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005504u)

/** \brief  508, CRCI Overview Set Register 0 */
#define PSI5_CRCISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005508u)

/** \brief  C, PSI5 Fractional Divider Register */
#define PSI5_FDR /*lint --e(923)*/ (*(volatile Ifx_PSI5_FDR*)0xF000500Cu)

/** \brief  14, Fractional Divider Register for Higher Bit Rate */
#define PSI5_FDRH /*lint --e(923)*/ (*(volatile Ifx_PSI5_FDRH*)0xF0005014u)

/** \brief  10, Fractional Divider Register for Lower Bit Rate */
#define PSI5_FDRL /*lint --e(923)*/ (*(volatile Ifx_PSI5_FDRL*)0xF0005010u)

/** \brief  18, Fractional Divider Register for Time Stamp */
#define PSI5_FDRT /*lint --e(923)*/ (*(volatile Ifx_PSI5_FDRT*)0xF0005018u)

/** \brief  2C, Global Control Register */
#define PSI5_GCR /*lint --e(923)*/ (*(volatile Ifx_PSI5_GCR*)0xF000502Cu)

/** \brief  8, Module Identification Register */
#define PSI5_ID /*lint --e(923)*/ (*(volatile Ifx_PSI5_ID*)0xF0005008u)

/** \brief  2FC, Interrupt Node Pointer Register */
#define PSI5_INP0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF00052FCu)

/** \brief  300, Interrupt Node Pointer Register */
#define PSI5_INP1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF0005300u)

/** \brief  304, Interrupt Node Pointer Register */
#define PSI5_INP2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF0005304u)

/** \brief  308, Interrupt Node Pointer Register */
#define PSI5_INP3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INP*)0xF0005308u)

/** \brief  360, Interrupt Clear Register A */
#define PSI5_INTCLRA0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005360u)

/** \brief  364, Interrupt Clear Register A */
#define PSI5_INTCLRA1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005364u)

/** \brief  368, Interrupt Clear Register A */
#define PSI5_INTCLRA2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005368u)

/** \brief  36C, Interrupt Clear Register A */
#define PSI5_INTCLRA3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF000536Cu)

/** \brief  374, Interrupt Clear Register A */
#define PSI5_INTCLRB0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005374u)

/** \brief  378, Interrupt Clear Register A */
#define PSI5_INTCLRB1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005378u)

/** \brief  37C, Interrupt Clear Register A */
#define PSI5_INTCLRB2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF000537Cu)

/** \brief  380, Interrupt Clear Register A */
#define PSI5_INTCLRB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005380u)

/** \brief  388, Interrupt Enable Register A */
#define PSI5_INTENA0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005388u)

/** \brief  38C, Interrupt Enable Register A */
#define PSI5_INTENA1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF000538Cu)

/** \brief  390, Interrupt Enable Register A */
#define PSI5_INTENA2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005390u)

/** \brief  394, Interrupt Enable Register A */
#define PSI5_INTENA3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005394u)

/** \brief  39C, Interrupt Enable Register B0 */
#define PSI5_INTENB0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF000539Cu)

/** \brief  3A0, Interrupt Enable Register B0 */
#define PSI5_INTENB1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A0u)

/** \brief  3A4, Interrupt Enable Register B0 */
#define PSI5_INTENB2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A4u)

/** \brief  3A8, Interrupt Enable Register B0 */
#define PSI5_INTENB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A8u)

/** \brief  2F8, Interrupt Overview Register */
#define PSI5_INTOV /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTOV*)0xF00052F8u)

/** \brief  338, Interrupt Set Register A */
#define PSI5_INTSETA0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005338u)

/** \brief  33C, Interrupt Set Register A */
#define PSI5_INTSETA1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF000533Cu)

/** \brief  340, Interrupt Set Register A */
#define PSI5_INTSETA2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005340u)

/** \brief  344, Interrupt Set Register A */
#define PSI5_INTSETA3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005344u)

/** \brief  34C, Interrupt Set Register B */
#define PSI5_INTSETB0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF000534Cu)

/** \brief  350, Interrupt Set Register B */
#define PSI5_INTSETB1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005350u)

/** \brief  354, Interrupt Set Register B */
#define PSI5_INTSETB2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005354u)

