Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_reg.h
/** \brief  358, Interrupt Set Register B */
#define PSI5_INTSETB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005358u)

/** \brief  310, Interrupt Status Register A */
#define PSI5_INTSTATA0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005310u)

/** \brief  314, Interrupt Status Register A */
#define PSI5_INTSTATA1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005314u)

/** \brief  318, Interrupt Status Register A */
#define PSI5_INTSTATA2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005318u)

/** \brief  31C, Interrupt Status Register A */
#define PSI5_INTSTATA3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF000531Cu)

/** \brief  324, Interrupt Status Register B */
#define PSI5_INTSTATB0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005324u)

/** \brief  328, Interrupt Status Register B */
#define PSI5_INTSTATB1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005328u)

/** \brief  32C, Interrupt Status Register B */
#define PSI5_INTSTATB2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF000532Cu)

/** \brief  330, Interrupt Status Register B */
#define PSI5_INTSTATB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005330u)

/** \brief  3D8, Kernel Reset Register 0 */
#define PSI5_KRST0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_KRST0*)0xF00053D8u)

/** \brief  3DC, Kernel Reset Register 1 */
#define PSI5_KRST1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_KRST1*)0xF00053DCu)

/** \brief  3E0, Kernel Reset Status Clear Register */
#define PSI5_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_PSI5_KRSTCLR*)0xF00053E0u)

/** \brief  5D8, MEI Overview Clear Register 0 */
#define PSI5_MEICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055D8u)

/** \brief  5DC, MEI Overview Clear Register 0 */
#define PSI5_MEICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055DCu)

/** \brief  5E0, MEI Overview Clear Register 0 */
#define PSI5_MEICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055E0u)

/** \brief  5E4, MEI Overview Clear Register 0 */
#define PSI5_MEICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055E4u)

/** \brief  498, MEI Overview Register */
#define PSI5_MEIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF0005498u)

/** \brief  49C, MEI Overview Register */
#define PSI5_MEIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF000549Cu)

/** \brief  4A0, MEI Overview Register */
#define PSI5_MEIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF00054A0u)

/** \brief  4A4, MEI Overview Register */
#define PSI5_MEIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF00054A4u)

/** \brief  538, MEI Overview Set Register 0 */
#define PSI5_MEISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005538u)

/** \brief  53C, MEI Overview Set Register 0 */
#define PSI5_MEISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF000553Cu)

/** \brief  540, MEI Overview Set Register 0 */
#define PSI5_MEISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005540u)

/** \brief  544, MEI Overview Set Register 0 */
#define PSI5_MEISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005544u)

/** \brief  574, NBI Overview Clear Register 0 */
#define PSI5_NBICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005574u)

/** \brief  578, NBI Overview Clear Register 0 */
#define PSI5_NBICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005578u)

/** \brief  57C, NBI Overview Clear Register 0 */
#define PSI5_NBICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF000557Cu)

/** \brief  580, NBI Overview Clear Register 0 */
#define PSI5_NBICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005580u)

/** \brief  434, NBI Overview Register */
#define PSI5_NBIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005434u)

/** \brief  438, NBI Overview Register */
#define PSI5_NBIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005438u)

/** \brief  43C, NBI Overview Register */
#define PSI5_NBIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF000543Cu)

/** \brief  440, NBI Overview Register */
#define PSI5_NBIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005440u)

/** \brief  4D4, NBI Overview Set Register 0 */
#define PSI5_NBISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054D4u)

/** \brief  4D8, NBI Overview Set Register 0 */
#define PSI5_NBISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054D8u)

/** \brief  4DC, NBI Overview Set Register 0 */
#define PSI5_NBISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054DCu)

/** \brief  4E0, NBI Overview Set Register 0 */
#define PSI5_NBISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054E0u)

/** \brief  5C4, NFI Overview Clear Register 0 */
#define PSI5_NFICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055C4u)

/** \brief  5C8, NFI Overview Clear Register 0 */
#define PSI5_NFICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055C8u)

/** \brief  5CC, NFI Overview Clear Register 0 */
#define PSI5_NFICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055CCu)

/** \brief  5D0, NFI Overview Clear Register 0 */
#define PSI5_NFICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055D0u)

/** \brief  484, NFI Overview Register */
#define PSI5_NFIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005484u)

/** \brief  488, NFI Overview Register */
#define PSI5_NFIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005488u)

/** \brief  48C, NFI Overview Register */
#define PSI5_NFIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF000548Cu)

/** \brief  490, NFI Overview Register */
#define PSI5_NFIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005490u)

/** \brief  524, NFI Overview Set Register 0 */
#define PSI5_NFISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005524u)

/** \brief  528, NFI Overview Set Register 0 */
#define PSI5_NFISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005528u)

/** \brief  52C, NFI Overview Set Register 0 */
#define PSI5_NFISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFISET*)0xF000552Cu)

/** \brief  530, NFI Overview Set Register 0 */
#define PSI5_NFISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005530u)

/** \brief  3CC, OCDS Control and Status */
#define PSI5_OCS /*lint --e(923)*/ (*(volatile Ifx_PSI5_OCS*)0xF00053CCu)

/** \brief  3F8, Receive Data FIFO */
#define PSI5_RDF0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDF*)0xF00053F8u)

/** \brief  3FC, Receive Data FIFO */
#define PSI5_RDF1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDF*)0xF00053FCu)

/** \brief  400, Receive Data FIFO */
#define PSI5_RDF2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDF*)0xF0005400u)

/** \brief  404, Receive Data FIFO */
#define PSI5_RDF3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDF*)0xF0005404u)

/** \brief  5B0, RDI Overview Clear Register 0 */
#define PSI5_RDICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDICLR*)0xF00055B0u)

/** \brief  5B4, RDI Overview Clear Register 0 */
#define PSI5_RDICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDICLR*)0xF00055B4u)

