Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_reg.h
/** \brief  948, Receive Data Memor0 Low 0y */
#define PSI5_RDM3_9_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005948u)

/** Alias (User Manual Name) for PSI5_RDM3_9_L.
* To use register names with standard convension, please use PSI5_RDM3_9_L.
*/
#define	PSI5_RDML39	(PSI5_RDM3_9_L)

/** \brief  3E4, Receive FIFO Control Register */
#define PSI5_RFC0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E4u)

/** \brief  3E8, Receive FIFO Control Register */
#define PSI5_RFC1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E8u)

/** \brief  3EC, Receive FIFO Control Register */
#define PSI5_RFC2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053ECu)

/** \brief  3F0, Receive FIFO Control Register */
#define PSI5_RFC3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053F0u)

/** \brief  560, RMI Overview Clear Register 0 */
#define PSI5_RMICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005560u)

/** \brief  564, RMI Overview Clear Register 0 */
#define PSI5_RMICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005564u)

/** \brief  568, RMI Overview Clear Register 0 */
#define PSI5_RMICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005568u)

/** \brief  56C, RMI Overview Clear Register 0 */
#define PSI5_RMICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF000556Cu)

/** \brief  420, RMI Overview Register */
#define PSI5_RMIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005420u)

/** \brief  424, RMI Overview Register */
#define PSI5_RMIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005424u)

/** \brief  428, RMI Overview Register */
#define PSI5_RMIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005428u)

/** \brief  42C, RMI Overview Register */
#define PSI5_RMIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF000542Cu)

/** \brief  4C0, RMI Overview Set Register 0 */
#define PSI5_RMISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C0u)

/** \brief  4C4, RMI Overview Set Register 0 */
#define PSI5_RMISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C4u)

/** \brief  4C8, RMI Overview Set Register 0 */
#define PSI5_RMISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C8u)

/** \brief  4CC, RMI Overview Set Register 0 */
#define PSI5_RMISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054CCu)

/** \brief  54C, RSI Overview Clear Register 0 */
#define PSI5_RSICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF000554Cu)

/** \brief  550, RSI Overview Clear Register 0 */
#define PSI5_RSICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005550u)

/** \brief  554, RSI Overview Clear Register 0 */
#define PSI5_RSICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005554u)

/** \brief  558, RSI Overview Clear Register 0 */
#define PSI5_RSICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005558u)

/** \brief  40C, RSI Overview Register */
#define PSI5_RSIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF000540Cu)

/** \brief  410, RSI Overview Register */
#define PSI5_RSIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005410u)

/** \brief  414, RSI Overview Register */
#define PSI5_RSIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005414u)

/** \brief  418, RSI Overview Register */
#define PSI5_RSIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005418u)

/** \brief  4AC, RSI Overview Set Register 0 */
#define PSI5_RSISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054ACu)

/** \brief  4B0, RSI Overview Set Register 0 */
#define PSI5_RSISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B0u)

/** \brief  4B4, RSI Overview Set Register 0 */
#define PSI5_RSISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B4u)

/** \brief  4B8, RSI Overview Set Register 0 */
#define PSI5_RSISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B8u)

/** \brief  588, TEI Overview Clear Register 0 */
#define PSI5_TEICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005588u)

/** \brief  58C, TEI Overview Clear Register 0 */
#define PSI5_TEICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF000558Cu)

/** \brief  590, TEI Overview Clear Register 0 */
#define PSI5_TEICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005590u)

/** \brief  594, TEI Overview Clear Register 0 */
#define PSI5_TEICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005594u)

/** \brief  448, TEI Overview Register */
#define PSI5_TEIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005448u)

/** \brief  44C, TEI Overview Register */
#define PSI5_TEIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF000544Cu)

/** \brief  450, TEI Overview Register */
#define PSI5_TEIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005450u)

/** \brief  454, TEI Overview Register */
#define PSI5_TEIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005454u)

/** \brief  4E8, TEI Overview Set Register 0 */
#define PSI5_TEISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054E8u)

/** \brief  4EC, TEI Overview Set Register 0 */
#define PSI5_TEISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054ECu)

/** \brief  4F0, TEI Overview Set Register 0 */
#define PSI5_TEISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F0u)

/** \brief  4F4, TEI Overview Set Register 0 */
#define PSI5_TEISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F4u)

/** \brief  1C, Module Time Stamp Register A */
#define PSI5_TSRA /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF000501Cu)

/** \brief  20, Time Stamp Register B */
#define PSI5_TSRB /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF0005020u)

/** \brief  24, Module Time Stamp Register C */
#define PSI5_TSRC /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF0005024u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5_REG_H */
